In [5]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'2.2.3'

## pandas    : Excel
## DataFrame : worksheet
## Series : column
## index  : row headings
## row : row
## nan : empty cell

# Series

In [9]:
obj = pd.Series([3.4, 2.5, 6.8, 4.9, 5.8])
obj

0    3.4
1    2.5
2    6.8
3    4.9
4    5.8
dtype: float64

In [10]:
obj = pd.Series(np.array([3.4, 2.5, 6.8, 4.9, 5.8]))
obj

0    3.4
1    2.5
2    6.8
3    4.9
4    5.8
dtype: float64

In [11]:
type(obj)

pandas.core.series.Series

In [12]:
obj.values

array([3.4, 2.5, 6.8, 4.9, 5.8])

# DataFrame

In [43]:
df = pd.DataFrame(
    {
        "Name" : ['Alice', 'Bobby', 'Charlie', 'Dorathy'],
        'Gender' :['female' ,'male','male','female'],
        'Age':[25,30, 58, 42],
        'Height': [1.68, 1.72,  1.58, 1.63]
        
    }
)
df

      Name  Gender  Age  Height
0    Alice  female   25    1.68
1    Bobby    male   30    1.72
2  Charlie    male   58    1.58
3  Dorathy  female   42    1.63

In [33]:
df1 = pd.DataFrame(
    [['Alice', 'female', 25, 1.68],
     ['Bobby','male',30, 1.72],
      ['Charlie','male',58,58],
    [ 'Dorathy','female', 42, 1.63]],
    columns = ["Name",'Gender','Age','Hight'],
    index = np.arange(2,6,1))
        
df1

      Name  Gender  Age  Hight
2    Alice  female   25   1.68
3    Bobby    male   30   1.72
4  Charlie    male   58  58.00
5  Dorathy  female   42   1.63

In [36]:
df.Name

0      Alice
1      Bobby
2    Charlie
3    Dorathy
Name: Name, dtype: object

In [45]:
df['Name']

0      Alice
1      Bobby
2    Charlie
3    Dorathy
Name: Name, dtype: object

In [44]:
df['Height'].max()

1.72

In [46]:
df['Age'].mean()

38.75

In [47]:
df.describe()

             Age    Height
count   4.000000  4.000000
mean   38.750000  1.652500
std    14.682756  0.060759
min    25.000000  1.580000
25%    28.750000  1.617500
50%    36.000000  1.655000
75%    46.000000  1.690000
max    58.000000  1.720000

# import CSV

In [76]:
df_hsi = pd.read_csv("^HSI.csv")
df_hsi

,Date,Open,High,Low,Close,Adj Close,Volume
0,2022-01-03,23510.539063,23605.029297,23193.189453,23274.750000,23274.750000,734331100
1,2022-01-04,23400.619141,23439.300781,23146.890625,23289.839844,23289.839844,1760141200
2,2022-01-05,23323.769531,23323.769531,22851.500000,22907.250000,22907.250000,2768859000
3,2022-01-06,22843.199219,23082.949219,22709.599609,23072.859375,23072.859375,1765786100
4,2022-01-07,23318.919922,23497.500000,23162.849609,23493.380859,23493.380859,2602290600
...,...,...,...,...,...,...,...
241,2022-12-22,19537.449219,19735.000000,19475.679688,19679.220703,19679.220703,1939795100
242,2022-12-23,19382.230469,19686.769531,19380.470703,19593.060547,19593.060547,1363741800
243,2022-12-28,19787.939453,20099.769531,19787.939453,19898.910156,19898.910156,2823780600
244,2022-12-29,19648.400391,19764.519531,19539.839844,19741.140625,19741.140625,2902362900
245,2022-12-30,20030.849609,20073.919922,19781.410156,19781.410156,19781.410156,1747706800

# find the first 3 row .head , .tail

In [49]:
df_hsi.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2022-01-03,23510.539063,23605.029297,23193.189453,23274.750000,23274.750000,734331100
1,2022-01-04,23400.619141,23439.300781,23146.890625,23289.839844,23289.839844,1760141200
2,2022-01-05,23323.769531,23323.769531,22851.500000,22907.250000,22907.250000,2768859000

In [50]:
df_hsi.tail(1)

The history saving thread hit an unexpected error (OperationalError('attempt to write a readonly database')).History will not be written to the database.

,Date,Open,High,Low,Close,Adj Close,Volume
245,2022-12-30,20030.849609,20073.919922,19781.410156,19781.410156,19781.410156,1747706800

In [54]:
import yfinance as yf

In [58]:
df_HSI = yf.download("^HSI", start = '2022-01-01', end = '2023-01-01', 
                     auto_adjust = True).droplevel('Ticker', axis =1)
df_HSI

[*********************100%***********************]  1 of 1 completed

Price              Close          High           Low          Open      Volume
Date
2022-01-03  23274.750000  23605.029297  23193.189453  23510.539062   734300000
2022-01-04  23289.839844  23439.300781  23146.890625  23400.619141  1760100000
2022-01-05  22907.250000  23323.769531  22851.500000  23323.769531  2768900000
2022-01-06  23072.859375  23082.949219  22709.599609  22843.199219  1765800000
2022-01-07  23493.380859  23497.500000  23162.849609  23318.919922  2602300000
...                  ...           ...           ...           ...         ...
2022-12-22  19679.220703  19735.000000  19475.679688  19537.449219  1939800000
2022-12-23  19593.060547  19686.769531  19380.470703  19382.230469  1363700000
2022-12-28  19898.910156  20099.769531  19787.939453  19787.939453  2823800000
2022-12-29  19741.140625  19764.519531  19539.839844  19648.400391  2902400000
2022-12-30  19781.410156  20073.919922  19781.410156  20030.849609  1747700000

[246 rows x 5 columns]

In [59]:
df_hsi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 246 entries, 0 to 245
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       246 non-null    object
 1   Open       246 non-null    float64
 2   High       246 non-null    float64
 3   Low        246 non-null    float64
 4   Close      246 non-null    float64
 5   Adj Close  246 non-null    float64
 6   Volume     246 non-null    int64
dtypes: float64(5), int64(1), object(1)
memory usage: 13.6+ KB

In [60]:
df_hsi.shape

(246, 7)

# ***change the Date type from 'string' to 'datetime'

In [62]:
# set the Data to padas datetime format instead of an object
df_hsi['Date'] = pd.to_datetime(df_hsi['Date'], format = '%Y-%m-%d')

In [63]:
df_hsi.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 246 entries, 0 to 245
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       246 non-null    datetime64[ns]
 1   Open       246 non-null    float64
 2   High       246 non-null    float64
 3   Low        246 non-null    float64
 4   Close      246 non-null    float64
 5   Adj Close  246 non-null    float64
 6   Volume     246 non-null    int64
dtypes: datetime64[ns](1), float64(5), int64(1)
memory usage: 13.6 KB

# 轉date 做 index , set Date as index, you may set a few series (column) to be index
## DatetimeIndex:

In [87]:
df_hsi = df_hsi.set_index('Date')

In [88]:
df_hsi.info()

<class 'pandas.core.frame.DataFrame'>
Index: 246 entries, 2022-01-03 to 2022-12-30
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Open       246 non-null    float64
 1   High       246 non-null    float64
 2   Low        246 non-null    float64
 3   Close      246 non-null    float64
 4   Adj Close  246 non-null    float64
 5   Volume     246 non-null    int64
dtypes: float64(5), int64(1)
memory usage: 13.5+ KB

In [ ]:
# 搵nan

In [73]:
df_hsi.isna().sum()

Open         0
High         0
Low          0
Close        0
Adj Close    0
Volume       0
dtype: int64

# check if there was ay empty/ nan/  null in data

In [74]:
df_hsi.isna().values.any()

False

 # Filtering & Selection a DataFrame

In [89]:
df_hsi['Close'].head(2) #select as pd Series

Date
2022-01-03    23274.750000
2022-01-04    23289.839844
Name: Close, dtype: float64

In [90]:
df_hsi[['Close']].head(2) #select as pd Data Frame

                   Close
Date
2022-01-03  23274.750000
2022-01-04  23289.839844

In [80]:
df_hsi[['Close','Volume']].head(3) # select two columns as pd Data Frame

          Close      Volume
0  23274.750000   734331100
1  23289.839844  1760141200
2  22907.250000  2768859000

# 用 .loc[條件]  搵升市 日子

In [91]:
%%time
df_hsi.loc[df_hsi['Close']>df_hsi['Open']] # selct at PD DF

CPU times: user 985 μs, sys: 262 μs, total: 1.25 ms
Wall time: 1.24 ms

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2022-01-06,22843.199219,23082.949219,22709.599609,23072.859375,23072.859375,1765786100
2022-01-07,23318.919922,23497.500000,23162.849609,23493.380859,23493.380859,2602290600
2022-01-10,23523.900391,23790.519531,23399.089844,23746.539063,23746.539063,2544917200
2022-01-11,23678.689453,23863.830078,23595.009766,23739.060547,23739.060547,2331482400
2022-01-12,24069.519531,24402.169922,24069.519531,24402.169922,24402.169922,2489491200
...,...,...,...,...,...,...
2022-12-16,19343.699219,19621.130859,19130.529297,19450.669922,19450.669922,2875978600
2022-12-22,19537.449219,19735.000000,19475.679688,19679.220703,19679.220703,1939795100
2022-12-23,19382.230469,19686.769531,19380.470703,19593.060547,19593.060547,1363741800
2022-12-28,19787.939453,20099.769531,19787.939453,19898.910156,19898.910156,2823780600
2022-12-29,19648.400391,19764.519531,19539.839844,19741.140625,19741.140625,2902362900

## .loc 搵 2022-03-01 嘅頭3日

In [94]:
df_hsi.loc[df_hsi.index >= '2022-03-01'].head(3)

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2022-03-01,22739.839844,22937.560547,22591.730469,22761.710938,22761.710938,1796043100
2022-03-02,22568.359375,22712.439453,22299.140625,22343.919922,22343.919922,2227896000
2022-03-03,22434.259766,22543.419922,22378.109375,22467.339844,22467.339844,1937725100

In [99]:
df_hsi.iloc[:5]

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2022-01-03,23510.539063,23605.029297,23193.189453,23274.750000,23274.750000,734331100
2022-01-04,23400.619141,23439.300781,23146.890625,23289.839844,23289.839844,1760141200
2022-01-05,23323.769531,23323.769531,22851.500000,22907.250000,22907.250000,2768859000
2022-01-06,22843.199219,23082.949219,22709.599609,23072.859375,23072.859375,1765786100
2022-01-07,23318.919922,23497.500000,23162.849609,23493.380859,23493.380859,2602290600

In [98]:
df_hsi.at[df_hsi.index[4],'Open']

23318.919922

In [100]:
df_hsi.iat[4,4]

23493.380859

In [101]:
df_hsi.iat[0,0]

23510.539063

In [102]:
import sqlite3

In [ ]:
query = """
CREATE TABLE sales(
firstname VARCHAR(20), 
lastname VARCHAR(20),
age INTEGER,
sales REAL        
);
"""

In [ ]:
con = sqlite3.connect('sales.sqlite')
con.execute(query)   # you can create a table once

In [ ]:
con.commit()

In [ ]:
data = [('David', 'Chan', 35, 68000.50),
        ('Edgar', 'Doe', 45, 79000.60),
        ('Fion', 'Elle', 30, 88650.30)]
stmt = "INSERT INTO sales VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)